app/controllers/posts_controller.rb

  def show
  	@post = Post.find(params[:id])
  	@posts_show = Post.limit(3)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" ORDER BY RAND() LIMIT 3